//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ДатаРожденияЧеловека(Парам01)","ДатаРожденияЧеловека","Допустим дата рождения человека 03.05.2000");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ТекущаяДатаДляРасчета(Парам01)","ТекущаяДатаДляРасчета","Когда текущая дата для расчета 22.08.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВозрастЧеловекаВМесяцахРавен(Парам01)","ВозрастЧеловекаВМесяцахРавен","Тогда возраст человека в месяцах равен 195");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим дата рождения человека 03.05.2000
//@ДатаРожденияЧеловека(Парам01)
Процедура ДатаРожденияЧеловека(Парам01) Экспорт
	Контекст.Вставить("ДатаРождения",Парам01);
КонецПроцедуры

&НаКлиенте
//Когда текущая дата для расчета 22.08.2016
//@ТекущаяДатаДляРасчета(Парам01)
Процедура ТекущаяДатаДляРасчета(Парам01) Экспорт
	Контекст.Вставить("ТекущаяДата",Парам01);
КонецПроцедуры

&НаКлиенте
//Тогда возраст человека в месяцах равен 195
//@ВозрастЧеловекаВМесяцахРавен(Парам01)
Процедура ВозрастЧеловекаВМесяцахРавен(Парам01) Экспорт
	
	Результат = ОбщийМодуль1.ПолучитьВозрастВМесяцах(Контекст.ДатаРождения,Контекст.ТекущаяДата);
	
	Если Результат <> Парам01 Тогда	
		ВызватьИсключение "Результат неверный";
	КонецЕсли;
	
КонецПроцедуры

//окончание текста модуля